# IN CLASS LAB EXERCISE 03

In [1]:
import pandas as pd
import os

**Data Description:-**

**Survival**
0 = No, 1 = Yes

**pclass**
Ticket class
1 = 1st, 2 = 2nd, 3 = 3rd

**sex**
Sex

**Age**
Age in years

**sibsp**
siblings / spouses aboard the Titanic

**parch**
parents / children aboard the Titanic

**ticket**
Ticket number

**fare**
Passenger fare

**cabin**
Cabin number

**embarked**
Port of Embarkation
C = Cherbourg, Q = Queenstown, S = Southampton

In [2]:
print(os.listdir('./data/'))
pd.set_option('display.max_rows',None)
pd.set_option('display.max_columns',None)
pd.set_option('display.width',1000)

['cmpdata1.csv', 'cmpdata2.csv', 'empdata11.csv', 'empdata12.csv', 'Humidity1.csv', 'test.csv', 'train.csv']

**Q.no (1) . Write a code to load 'train.csv' as data1 & 'test.csv' as data2.**

In [3]:
data1 = pd.read_csv('./data/train.csv')
data2 = pd.read_csv('./data/test.csv')
print(data1.columns);print();print(data2.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')

----

**Q.no (2) . Write a code to `concanate` data1 & data2 assign it as  `data_01`.**

In [4]:
data_01 = pd.concat([data1,data2],sort=False,join="inner")
print(data1.shape)
print(data2.shape)
print(data_01.shape)

(891, 12)
(418, 11)
(1309, 11)

---------------------------

**Q.no(3).Write a code to `MERGE`(`outer`)  data1 & data2 as `data`.**

In [5]:
df_merge = pd.merge(data1,data2,how="outer",on=["PassengerId","Name"],indicator=True,suffixes=('_train','_test'))
print(df_merge.shape)
df_merge.head()

(1309, 22)

   PassengerId  Survived  Pclass_train                                               Name Sex_train  Age_train  SibSp_train  Parch_train      Ticket_train  Fare_train Cabin_train Embarked_train  Pclass_test Sex_test  Age_test  SibSp_test  Parch_test Ticket_test  Fare_test Cabin_test Embarked_test     _merge
0            1       0.0           3.0                            Braund, Mr. Owen Harris      male       22.0          1.0          0.0         A/5 21171      7.2500         NaN              S          NaN      NaN       NaN         NaN         NaN         NaN        NaN        NaN           NaN  left_only
1            2       1.0           1.0  Cumings, Mrs. John Bradley (Florence Briggs Th...    female       38.0          1.0          0.0          PC 17599     71.2833         C85              C          NaN      NaN       NaN         NaN         NaN         NaN        NaN        NaN           NaN  left_only
2            3       1.0           3.0                             Heikkinen, Miss. Laina    female       26.0          0.0          0.0  STON/O2. 3101282      7.9250         NaN              S          NaN      NaN       NaN         NaN         NaN         NaN        NaN        NaN           NaN  left_only
3            4       1.0           1.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)    female       35.0          1.0          0.0            113803     53.1000        C123              S          NaN      NaN       NaN         NaN         NaN         NaN        NaN        NaN           NaN  left_only
4            5       0.0           3.0                           Allen, Mr. William Henry      male       35.0          0.0          0.0            373450      8.0500         NaN              S          NaN      NaN       NaN         NaN         NaN         NaN        NaN        NaN           NaN  left_only

In [6]:
data1.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')

----

**Q.no(4).Write a code to `JOIN`(`inner`) data1 & data2 as `data11`.**

In [7]:
data11= data1.join(data2,how="inner",on="PassengerId",lsuffix="_x",rsuffix="_y",sort=False)
data11.head(10)

   PassengerId  PassengerId_x  Survived  Pclass_x                                             Name_x   Sex_x  Age_x  SibSp_x  Parch_x          Ticket_x   Fare_x Cabin_x Embarked_x  PassengerId_y  Pclass_y                                        Name_y   Sex_y  Age_y  SibSp_y  Parch_y   Ticket_y   Fare_y Cabin_y Embarked_y
0            1              1         0         3                            Braund, Mr. Owen Harris    male   22.0        1        0         A/5 21171   7.2500     NaN          S            893         3              Wilkes, Mrs. James (Ellen Needs)  female   47.0        1        0     363272   7.0000     NaN          S
1            2              2         1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38.0        1        0          PC 17599  71.2833     C85          C            894         2                     Myles, Mr. Thomas Francis    male   62.0        0        0     240276   9.6875     NaN          Q
2            3              3         1         3                             Heikkinen, Miss. Laina  female   26.0        0        0  STON/O2. 3101282   7.9250     NaN          S            895         3                              Wirz, Mr. Albert    male   27.0        0        0     315154   8.6625     NaN          S
3            4              4         1         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35.0        1        0            113803  53.1000    C123          S            896         3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female   22.0        1        1    3101298  12.2875     NaN          S
4            5              5         0         3                           Allen, Mr. William Henry    male   35.0        0        0            373450   8.0500     NaN          S            897         3                    Svensson, Mr. Johan Cervin    male   14.0        0        0       7538   9.2250     NaN          S
5            6              6         0         3                                   Moran, Mr. James    male    NaN        0        0            330877   8.4583     NaN          Q            898         3                          Connolly, Miss. Kate  female   30.0        0        0     330972   7.6292     NaN          Q
6            7              7         0         1                            McCarthy, Mr. Timothy J    male   54.0        0        0             17463  51.8625     E46          S            899         2                  Caldwell, Mr. Albert Francis    male   26.0        1        1     248738  29.0000     NaN          S
7            8              8         0         3                     Palsson, Master. Gosta Leonard    male    2.0        3        1            349909  21.0750     NaN          S            900         3     Abrahim, Mrs. Joseph (Sophie Halaut Easu)  female   18.0        0        0       2657   7.2292     NaN          C
8            9              9         1         3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female   27.0        0        2            347742  11.1333     NaN          S            901         3                       Davies, Mr. John Samuel    male   21.0        2        0  A/4 48871  24.1500     NaN          S
9           10             10         1         2                Nasser, Mrs. Nicholas (Adele Achem)  female   14.0        1        0            237736  30.0708     NaN          C            902         3                              Ilieff, Mr. Ylio    male    NaN        0        0     349220   7.8958     NaN          S

-----------

**Q.no(5) . Write a code to `RENAME` the column from `sex` to `gender` and assign it to the new dataframe named as `data_02`.**

In [8]:
print(data2.columns)
column = {"Sex":"Gender"}
data_02 = data2.rename(columns=column)
print(data_02.columns)

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')
Index(['PassengerId', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')

--------------

**Q.no(6) . Write a code to `drop` the column 'Ticket' and assign it to the new dataframe named as `data_03`.**

In [9]:
print(data1.columns)
data_03 = data1.drop(labels='Ticket', axis=1)
print(data_03.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')
Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked'], dtype='object')

-----

**Q.no(7) . Write a code to `drop` the first five  `rows` of `data_03` as per there `index position`  .**

In [10]:
data_03.drop(index=list(range(5))).head()

   PassengerId  Survived  Pclass                                               Name     Sex   Age  SibSp  Parch     Fare Cabin Embarked
5            6         0       3                                   Moran, Mr. James    male   NaN      0      0   8.4583   NaN        Q
6            7         0       1                            McCarthy, Mr. Timothy J    male  54.0      0      0  51.8625   E46        S
7            8         0       3                     Palsson, Master. Gosta Leonard    male   2.0      3      1  21.0750   NaN        S
8            9         1       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0      2  11.1333   NaN        S
9           10         1       2                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1      0  30.0708   NaN        C

-----

**Q.no(8) . Write a code to `drop` the `column no. 2 ` of `data_03` as per there `index position` .**

In [11]:
print(data_03.columns)
print(data_03.drop(data_03.columns[3],axis=1).head())

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked'], dtype='object')
   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin Embarked
0            1         0       3    male  22.0      1      0   7.2500   NaN        S
1            2         1       1  female  38.0      1      0  71.2833   C85        C
2            3         1       3  female  26.0      0      0   7.9250   NaN        S
3            4         1       1  female  35.0      1      0  53.1000  C123        S
4            5         0       3    male  35.0      0      0   8.0500   NaN        S

------

**Q.no(9). Write a code to replace all the `3` in the `Pclass` to `2` of `data_02`and assign it to the new dataframe named as `data_04`.**

In [12]:
data_04 = data_02['Pclass'].replace({3:2})
print(data_02['Pclass'].head())
data_04.head(10)

0    3
1    3
2    2
3    3
4    3
Name: Pclass, dtype: int64

0    2
1    2
2    2
3    2
4    2
5    2
6    2
7    2
8    2
9    2
Name: Pclass, dtype: int64

-------

**Q.no(10). Write a code to `map` all the females who are in `Pclass - 1` and males in `Pclass - 2` in `data_02`.**

In [13]:
data_02['p_gender'] = data1['Pclass'].map({1:"female",2:"male"})
data_02.head()

   PassengerId  Pclass                                          Name  Gender   Age  SibSp  Parch   Ticket     Fare Cabin Embarked p_gender
0          892       3                              Kelly, Mr. James    male  34.5      0      0   330911   7.8292   NaN        Q      NaN
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female  47.0      1      0   363272   7.0000   NaN        S   female
2          894       2                     Myles, Mr. Thomas Francis    male  62.0      0      0   240276   9.6875   NaN        Q      NaN
3          895       3                              Wirz, Mr. Albert    male  27.0      0      0   315154   8.6625   NaN        S   female
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female  22.0      1      1  3101298  12.2875   NaN        S      NaN

--------------------

**Q.no(11). Write a code to identify duplicates in `Cabin` column and show a `count` of it from `data_02`.**

In [14]:
print(data_02["Cabin"].head())
count = data_02.duplicated(subset=["Cabin"])
print(count.sum())

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: Cabin, dtype: object
341

----------------

**Q.no(12). Write a code to `drop` all duplicates in `Fare` column from `data_03` and show `info()`.**

In [15]:
print(data_03.info(),'\n')
data_03.drop_duplicates(["Fare"],inplace=True)
print(data_03.info(),'\n')
print(data_03["Fare"].head())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 62.7+ KB
None

<class 'pandas.core.frame.DataFrame'>
Int64Index: 248 entries, 0 to 882
Data columns (total 11 columns):
PassengerId    248 non-null int64
Survived       248 non-null int64
Pclass         248 non-null int64
Name           248 non-null object
Sex            248 non-null object
Age            202 non-null float64
SibSp          248 non-null int64
Parch          248 non-null int64
Fare           248 non-null float64
Cabin          83 non-null object
Embarked       247 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 19.4+ KB
None

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

-----

**Q.no(13). Write a code to `show the summary statistics` for all numeric columns of  `data_01`.**

In [16]:
data_01.describe()

       PassengerId       Pclass          Age        SibSp        Parch         Fare
count  1309.000000  1309.000000  1046.000000  1309.000000  1309.000000  1308.000000
mean    655.000000     2.294882    29.881138     0.498854     0.385027    33.295479
std     378.020061     0.837836    14.413493     1.041658     0.865560    51.758668
min       1.000000     1.000000     0.170000     0.000000     0.000000     0.000000
25%     328.000000     2.000000    21.000000     0.000000     0.000000     7.895800
50%     655.000000     3.000000    28.000000     0.000000     0.000000    14.454200
75%     982.000000     3.000000    39.000000     1.000000     0.000000    31.275000
max    1309.000000     3.000000    80.000000     8.000000     9.000000   512.329200

-----

**Q.no(14). Write a code to `show the summary statistics` for all columns that including 'categorical columns' of  `data_01`.**

In [17]:
data_01.describe(include="all")

        PassengerId       Pclass                  Name   Sex          Age        SibSp        Parch    Ticket         Fare        Cabin Embarked
count   1309.000000  1309.000000                  1309  1309  1046.000000  1309.000000  1309.000000      1309  1308.000000          295     1307
unique          NaN          NaN                  1307     2          NaN          NaN          NaN       929          NaN          186        3
top             NaN          NaN  Connolly, Miss. Kate  male          NaN          NaN          NaN  CA. 2343          NaN  C23 C25 C27        S
freq            NaN          NaN                     2   843          NaN          NaN          NaN        11          NaN            6      914
mean     655.000000     2.294882                   NaN   NaN    29.881138     0.498854     0.385027       NaN    33.295479          NaN      NaN
std      378.020061     0.837836                   NaN   NaN    14.413493     1.041658     0.865560       NaN    51.758668          NaN      NaN
min        1.000000     1.000000                   NaN   NaN     0.170000     0.000000     0.000000       NaN     0.000000          NaN      NaN
25%      328.000000     2.000000                   NaN   NaN    21.000000     0.000000     0.000000       NaN     7.895800          NaN      NaN
50%      655.000000     3.000000                   NaN   NaN    28.000000     0.000000     0.000000       NaN    14.454200          NaN      NaN
75%      982.000000     3.000000                   NaN   NaN    39.000000     1.000000     0.000000       NaN    31.275000          NaN      NaN
max     1309.000000     3.000000                   NaN   NaN    80.000000     8.000000     9.000000       NaN   512.329200          NaN      NaN

---------------

**Q.no(15). Write a code to show `average` `age` of all the passengers of `data_01`.**

In [18]:
data_01['Age'].mean()

29.881137667304014

-------------------

**Q.no(16). Write a code to show the Middle value in `Survived` column of all the passengers from `data_01`.**

In [19]:
# My data_01 is not having survived column
data1['Survived'].median()

0.0

-----------------

**Q.no(17). Write a code to show mostly paid fare by all the passengers from `data_01`.**

In [20]:
data_01.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype='object')

In [21]:
print(data_01['Fare'].mode())

0    8.05
dtype: float64

---------------

**Q.no(18). Write a code to show how much do the `fare` is `skewed` in `data_01`.**

In [22]:
data_01['Fare'].skew()

4.367709134122922

------------

**Q.no(19). Write a code to show how much is the `kurtosis` in `Age` column for data_01.**

In [23]:
data_01['Age'].kurtosis()

0.1469476357378139

-------

**Q.no(20).Write a code to show the `average age` of all the genders as per there respective `passenger class(Pclass)` for data_01.**

In [24]:
pd.pivot_table(data_01,index="Pclass",aggfunc="mean")['Age']

Pclass
1    39.159930
2    29.506705
3    24.816367
Name: Age, dtype: float64

--------------

**Q.no(21). Write a code to show the `average fare` for all `individual` `'Pclass'`.**

In [25]:
pd.pivot_table(data_01,index="Pclass",aggfunc="mean")['Fare']

Pclass
1    87.508992
2    21.179196
3    13.302889
Name: Fare, dtype: float64

----------

# -----------------------------------HAPPY LEARNING-----------------------------------------

------